Repository: taku0/lambda_ja
Catalog: lambda_ja-level1.tmx
Source language: en_us
Languages: ja

source: (Depending on the specific reduction operation, this may perform better or worse, depending on the relative cost of the accumulator and combiner functions.)
ja: (具体的な簡約処理によっては、これはより性能が良い場合もあれば悪い場合もある。これは累積関数と統合関数の相対的なコストに依存する)。

source: (Even if the language had a "parallel for-each" construct, the mutative accumulation approach would still required the developer to provide thread-safe updates to the shared accumulating variable {@code sum}, and the required synchronization would then likely eliminate any performance gain from parallelism.) Using {@code reduce()} instead removes all of the burden of parallelizing the reduction operation, and the library can provide an efficient parallel implementation with no additional synchronization required.
ja: (たとえ言語が「並列for-each」文を備えていたとしても、可変な累積を使う方法では共有累積変数{@code sum}の更新に対するスレッド安全性を開発者が確保する必要があり、そこで必要となる同期は、並列化から得られる効率の向上をほとんど失なわせてしまうだろう)。代わりに{@code reduce()}を使えば簡約処理を並列化する際の一切の面倒を除去でき、ライブラリは余分な同期処理を必要とせずに効率的な並列実装を提供できるようになる。

source: (For example, an unordered collector that accumulated elements to a {@code List} would consider two lists equivalent if they contained the same elements, ignoring order.)
ja: (例えば、要素を{@code List}に累積する、順序を持たないコレクタは、2つのリストが順序を無視して同じ要素を含んでいれば等価であるとして扱うだろう)。

source: (For example, {@link Collection#stream() Collection.stream()} creates a sequential stream, and {@link Collection#parallelStream() Collection.parallelStream()} creates a parallel one.) This choice of execution mode may be modified by the {@link #sequential()} or {@link #parallel()} methods, and may be queried with the {@link #isParallel()} method.
ja: (例えば、{@link Collection#stream() Collection.stream()}は逐次ストリームを作成し、{@link Collection#parallelStream() Collection.parallelStream()}は並列ストリームを作成する)。この実行モードの選択は{@link #sequential()}メソッドや{@link #parallel()}メソッドで変更でき、{@link #isParallel()}メソッドで調べられる。

source: (If a mapped stream is {@code null} an empty stream is used, instead.)
ja: (もし写像されたストリームが{@code null}であれば、代わりに空のストリームが使われる)。

source: (If a stable result is desired, use {@link #findFirst()} instead.)
ja: (もし安定した結果を望むならば、代わりに{@link #findFirst()}を用いよ)。

source: (If a stream does require closing, it can be declared as a resource in a {@code try}-with-resources statement.)
ja: (もしストリームを閉じる必要がある場合、{@code try}-with-resources文の資源として宣言できる)。

source: (Summation is an example of a reduction operation.)
ja: (和の計算は簡約(reduction)処理の1例である)。

source: (The combiner is necessary in parallel reductions, where the input is partitioned, a partial accumulation computed for each partition, and then the partial results are combined to produce a final result.)
ja: (統合関数は並列簡約において必要である。並列簡約では入力が分割され、部分的な累積結果が各部分に対して計算され、そして最終結果を生成するために中間結果が統合される)。

source: (The {@code ?} for the second type parameter merely indicates that we don't care about the intermediate representation used by this collector.) If we wanted to create a collector to tabulate the sum of salaries by department, we could reuse {@code summingSalaries} using {@link java.util.stream.Collectors#groupingBy(java.util.function.Function, java.util.stream.Collector) groupingBy}:
ja: (第2型変数に対する{@code ?}は、単にコレクタが使う中間表現について気にしないという意味である)。もし部門ごとの給与の合計の表を作るコレクタを作りたいなら、{@link java.util.stream.Collectors#groupingBy(java.util.function.Function, java.util.stream.Collector) groupingBy}を利用して{@code summingSalaries}を再利用できる。

source: (This behavior becomes even more important when the input stream is infinite and not merely large.)
ja: (この挙動は入力のストリームが単に大きいだけでなく、無限である場合にはより重要となる)。

source: (This behavior is also implemented by the predefined collector {@link Collectors#toCollection(Supplier)}).
ja: この挙動は予め用意されたコレクタ{@link Collectors#toCollection(Supplier)}を使っても実装できる。

source: (This might be true if the result container has no intrinsic order, such as a {@link Set}.)
ja: (これは結果コンテナが{@link Set}など、本質的な順序を持たない場合に当てはまる)。

source: (where {@link java.util.stream.Collectors#groupingByConcurrent} is the concurrent equivalent of {@code groupingBy}).
ja: (ここで{@link java.util.stream.Collectors#groupingByConcurrent}は{@code groupingBy}の並行版である)。

source: .collect(Collectors.toList()); // No side-effects!
ja: .collect(Collectors.toList()); // 副作用無し!

source: .peek(e -> System.out.println("Filtered value: " + e))
ja: .peek(e -> System.out.println("絞り込まれた値: " + e))

source: .peek(e -> System.out.println("Mapped value: " + e))
ja: .peek(e -> System.out.println("写像された値: " + e))

source: // Accumulate names into a List
ja: // 名前をListに累積する

source: // Accumulate names into a TreeSet
ja: // 名前をTreeSetに累積する

source: // Compute sum of salaries by department
ja: // 部署ごとに給与の合計を求める

source: // Compute sum of salaries of employee
ja: // 従業員の給与の和を求める

source: // Convert elements to strings and concatenate them, separated by commas
ja: // 要素を文字列に変換し、カンマで区切って連結する

source: // Group employees by department
ja: // 部署ごとに従業員をグループ化する

source: // Partition students into passing and failing
ja: // 学生を合格者と不合格者に分ける

source: A mutable reduction operation that accumulates input elements into a mutable result container, optionally transforming the accumulated result into a final representation after all input elements have been processed.
ja: 入力要素を可変な結果コンテナに累積し、さらに追加可能な処理として、全ての入力要素が処理された後に累積した結果を最終形に変換する可変的簡約処理。

source: A mutable reduction operation accumulates input elements into a mutable result container, such as a {@code Collection} or {@code StringBuilder}, as it processes the elements in the stream.
ja: 可変的簡約処理(mutable reduction operation)は入力要素を処理しながら{@code Collection}や{@code StringBuilder}などの可変な結果コンテナに累積していく。

source: A reduction operation (also called a fold) takes a sequence of input elements and combines them into a single summary result by repeated application of a combining operation, such as finding the sum or maximum of a set of numbers, or accumulating elements into a list.
ja: 簡約(reduction)処理(折り畳み(fold)とも呼ばれる)は入力要素の列を受け取り、統合処理を繰り返し適用して1つの要約値に統合する。例えば数値の集合の和や最大値を求めたり、要素を1つのリストに累積する。

source: A behavioral parameter is said to interfere with a non-concurrent data source if it modifies, or causes to be modified, the stream's data source.
ja: 挙動パラメータはストリームの並行でない情報源を変更したり変更させたりするとき、情報源に干渉する(interfere)という

source: A concurrent reduction is one where the accumulator function is called concurrently from multiple threads, using the same concurrently-modifiable result container, rather than keeping the result isolated during accumulation.
ja: 並行的な簡約とは、累積中に結果を隔離するのではなく、並列に変更可能な同じ結果コンテナを使って累積関数が複数のスレッドから並行的に呼ばれる簡約である。

source: A concurrent reduction should only be applied if the collector has the {@link Characteristics#UNORDERED} characteristics or if the originating data is unordered.
ja: 並行的簡約はコレクタが{@link Characteristics#UNORDERED}特性を持つか、元のデータが順序を持たないときにのみ適用されるべきである。

source: A function that accepts two partial results and merges them.
ja: 部分的な結果を2つ取ってそれらを併合する関数。

source: A function that creates and returns a new mutable result container.
ja: 新しい可変な結果コンテナを作成して返す関数。

source: A function that folds a value into a mutable result container.
ja: 値を可変な結果コンテナに折り畳む関数。

source: A higher-quality spliterator will provide balanced and known-size splits, accurate sizing information, and a number of other {@link java.util.Spliterator#characteristics() characteristics} of the spliterator or data that can be used by implementations to optimize execution.
ja: より高品質のスプリッテレータは均等でサイズが既知となるような分割処理を備え、大きさに関する情報を累積し、スプリッテレータやデータに関する他のいくつもの{@link java.util.Spliterator#characteristics() 特性}を備えて実装が実行を最適化するのに使えるようにするだろう。

source: A more performant approach would be to accumulate the results into a {@link java.lang.StringBuilder}, which is a mutable container for accumulating strings.
ja: より性能面で良い方法は、{@link java.lang.StringBuilder}という、文字列を累積していく可変的コンテナに結果を累積していく方法だろう。

source: A mutable builder for a {@code DoubleStream}.
ja: {@code DoubleStream}の可変なビルダ

source: A mutable builder for a {@code LongStream}.
ja: {@code LongStream}の可変なビルダ

source: A mutable builder for a {@code Stream}.
ja: {@code Stream}の可変なビルダ

source: A mutable builder for an {@code IntStream}.
ja: {@code IntStream}の可変なビルダ

source: A mutable reduction is one in which the reduced value is a mutable result container, such as an {@code ArrayList}, and elements are incorporated by updating the state of the result rather than by replacing the result.
ja: 可変的簡約は、簡約した値が{@code ArrayList}などの可変な結果コンテナであるものであり、結果を置き換えるのではなく結果の状態を変更して各要素を組み入れるような簡約である。

source: A new sequential {@code IntStream}
ja: 新しい逐次的な{@code IntStream}

source: A parallel implementation would partition the input, create a result container for each partition, accumulate the contents of each partition into a subresult for that partition, and then use the combiner function to merge the subresults into a combined result.
ja: 並列実装は入力を分割し、各部分ごとに結果コンテナを作成し、各部分の要素を中間結果に対して累積し、統合関数を使って中間結果を併合して統合結果を得るだろう。

source: A sequence of elements supporting sequential and parallel aggregate operations.
ja: 逐次集計処理および並列集計処理を備える要素の列。

source: A sequence of primitive double-valued elements supporting sequential and parallel aggregate operations.
ja: プリミティブのdoubleである要素の列であり、逐次集計処理および並列集計処理を備える。

source: A sequence of primitive int-valued elements supporting sequential and parallel aggregate operations.
ja: プリミティブのintである要素の列であり、逐次集計処理および並列集計処理を備える。

source: A sequence of primitive long-valued elements supporting sequential and parallel aggregate operations.
ja: プリミティブのlongである要素の列であり、逐次集計処理および並列集計処理を備える。

source: A sequential implementation of a reduction using a collector would create a single result container using the supplier function, and invoke the accumulator function once for each input element.
ja: コレクタを使った簡約の逐次的な実装は供給関数を使って1つの結果コンテナのみを生成し、各入力要素に対して1回ずつ累積関数を呼びだすだろう。

source: A small number of stream operations, such as {@code forEach()} and {@code peek()}, can operate only via side-effects; these should be used with care.
ja: {@code forEach()}や{@code peek()}といった少数のストリーム処理は副作用のみを処理できる。それらは注意して使う必要がある。

source: A spliterator is the parallel analogue of an {@link java.util.Iterator}; it describes a (possibly infinite) collection of elements, with support for sequentially advancing, bulk traversal, and splitting off some portion of the input into another spliterator which can be processed in parallel.
ja: スプリッテレータは要素の(無限かもしれない)コレクションを表現する。そして逐次的に進めていく・まとめて走査する・並列に処理できる他のスプリッテレータに入力の一部を分割するといった処理を備える。

source: A stateful lambda (or other object implementing the appropriate functional interface) is one whose result depends on any state which might change during the execution of the stream pipeline.
ja: 状態を持つラムダ(または他の適切な関数的インターフェースを実装したオブジェクト)とは、ストリームパイプラインの実行中に変化する可能性がある何らかの状態に結果が依存するものである。

source: A stream builder has a lifecycle, which starts in a building phase, during which elements can be added, and then transitions to a built phase, after which elements may not be added.
ja: {@code StreamBuilder}はライフサイクルを持ち、要素を追加できる構築中段階から始まり、要素を追加できなくなる構築済段階に移行する。

source: A stream implementation may throw {@link IllegalStateException} if it detects that the stream is being reused.
ja: ストリームの実装はストリームが再利用されているのを検知した場合、{@link IllegalStateException}を投げる場合がある。

source: A stream is not a data structure that stores elements; instead, it conveys elements from a source such as a data structure, an array, a generator function, or an I/O channel, through a pipeline of computational operations.
ja: ストリームは要素を保持するデータ構造ではない。その代わりにデータ源(データ構造・ジェネレータ関数・IOチャネルなど)から計算処理のパイプラインを通して値をもたらす。

source: A stream pipeline consists of a source (such as a {@code Collection}, an array, a generator function, or an I/O channel); followed by zero or more intermediate operations such as {@code Stream.filter} or {@code Stream.map}; and a terminal operation such as {@code Stream.forEach} or {@code Stream.reduce}.
ja: ストリームパイプラインは複数の構成要素からなり、データ源(source, {@code Collection}・配列・ジェネレータ関数・IOチャネルなど)の後に{@code Stream.filter}や{@code Stream.map}といった零個以上の中間処理と{@code Stream.forEach}や{@code Stream.reduce}といった末端処理が続く。

source: A stream pipeline consists of a source (which might be an array, a collection, a generator function, an I/O channel, etc), zero or more intermediate operations (which transform a stream into another stream, such as {@link Stream#filter(Predicate)}), and a terminal operation (which produces a result or side-effect, such as {@link Stream#count()} or {@link Stream#forEach(Consumer)}).
ja: ストリームパイプラインは情報源(source、配列・コレクション・生成関数・I/Oチャンネルなど)、零個以上の中間処理(intermediate operations)({@link Stream#filter(Predicate)}のようにストリームを別のストリームに変換する)、末端処理(terminal operation)({@link Stream#count()}や{@link Stream#forEach(Consumer)}のように結果や副作用を生成する)からなる。

source: A stream pipeline, like the "widgets" example above, can be viewed as a query on the stream source.
ja: 上記の「ウィジェット」の例のようなストリームパイプラインはストリーム源に対する問い合わせとして見ることもできる。

source: A stream should be operated on (invoking an intermediate or terminal stream operation) only once.
ja: ストリームは一度だけ利用する(中間処理や末端処理を呼び出す)べきである。

source: A task to execute when the stream is closed
ja: ストリームが閉じられた場合に実行される作業

source: A terminal operation is short-circuiting if, when presented with infinite input, it may terminate in finite time.
ja: 末端処理は、無限の入力を与えられた際に有限の時間で終了する場合があるならば短絡的である。

source: A {@code Collector} encapsulates the functions used as arguments to {@link #collect(Supplier, BiConsumer, BiConsumer)}, allowing for reuse of collection strategies and composition of collect operations such as multiple-level grouping or partitioning.
ja: {@code Collector}は{@link #collect(Supplier, BiConsumer, BiConsumer)}の引数として使われる関数をカプセル化し、収集戦略の再利用を可能にすると共に、複数レベルのグループ化や組分けなどといった風に収集処理の合成を可能にする。

source: A {@code Collector} is specified by four functions that work together to accumulate entries into a mutable result container, and optionally perform a final transform on the result.
ja: {@code Collector}は要素を結果コンテナに協調して累積し、追加可能な処理として結果に対して最終的な変換をする4つの関数によって記述される。

source: A {@code Collector} which concatenates CharSequence elements, separated by the specified delimiter, in encounter order
ja: CharSequenceである要素を出現順に指定された文字列で区切って連結する{@code Collector}

source: A {@code Spliterator.OfDouble} describing the stream elements
ja: ストリーム要素を表す{@code Spliterator.OfDouble}

source: A {@code Supplier} of a {@code Spliterator.OfDouble}
ja: {@code Spliterator.OfDouble}の{@code Supplier}

source: A {@code collect} operation requires three functions: a supplier function to construct new instances of the result container, an accumulator function to incorporate an input element into a result container, and a combining function to merge the contents of one result container into another.
ja: {@code collect}処理は3つの関数を必要とする。新しい結果コンテナを構築する供給関数(supplier function)・結果コンテナに入力要素を取り入れる累積関数(accumulator function)・ある結果コンテナの中身を別のコンテナに併合する統合関数(combining function)である。

source: A {@link java.util.stream.Collector} that supports concurrent reduction is marked with the {@link java.util.stream.Collector.Characteristics#CONCURRENT} characteristic.
ja: 並行簡約をサポートする{@link java.util.stream.Collector}は{@link java.util.stream.Collector.Characteristics#CONCURRENT}特性の印が付けられている。

source: Accessing an element of a deeply concatenated stream can result in deep call chains, or even {@code StackOverflowException}.
ja: 深く連結されたストリームの要素にアクセスする際には、深い呼び出し連鎖が起きる場合があり、場合によっては{@code StackOverflowException}も起きる。

source: Accordingly, behavioral parameters in stream pipelines whose source might not be concurrent should never modify the stream's data source.
ja: したがって、情報源が並行的でない可能性があるストリームパイプラインの挙動パラメターはストリームの情報源を決して変更するべきではない。

source: Adapts a {@code Collector} accepting elements of type {@code U} to one accepting elements of type {@code T} by applying a mapping function to each input element before accumulation.
ja: {@code Collector}の各入力要素に対して累積前に写像関数を適用して、{@code U}型を受けとる{@code Collector}を{@code T}型を受けとる{@code Collector}へと適合させる。

source: Adapts a {@code Collector} to perform an additional finishing transformation.
ja: {@code Collector}に対して追加の仕上げ処理をするように適合させる。

source: Additional stream sources can be provided by third-party libraries using these techniques.
ja: その他にもストリームの情報源がサードパーティのライブラリからこれらの手法を使って用意されるだろう。

source: Additionally, the {@code combiner} function must be associative and must be compatible with the {@code accumulator} function: for all {@code u} and {@code t}, {@code combiner.apply(u, accumulator.apply(identity, t))} must be {@code equals()} to {@code accumulator.apply(u, t)}.
ja: 加えて、{@code combiner}関数は結合的であり、{@code accumulator}関数と適合する必要がある。つまり任意の{@code u}と{@code t}について{@code combiner.apply(u, accumulator.apply(identity, t))}は{@code accumulator.apply(u, t)}に対して{@code equals()}の意味で等しい必要がある。

source: Additionally, the {@code combiner} function must be compatible with the {@code accumulator} function; for all {@code u} and {@code t}, the following must hold:
ja: 加えて、{@code combiner}関数は{@code accumulator}関数と適合する必要がある。つまり任意の{@code u}と{@code t}について次の式が成り立つ必要がある。

source: Adds an element to the stream being built.
ja: 構築中のストリームに要素を追加する。

source: After the terminal operation is performed, the stream pipeline is considered consumed, and can no longer be used; if you need to traverse the same data source again, you must return to the data source to get a new stream.
ja: 末端処理を実行した後はそのストリームは消費されたものとみなされ、その後は利用できなくなる。もし同じ情報源を再び走査したい場合は、元のデータ源から新しいストリームを得る必要がある。

source: All close handlers are run, even if earlier close handlers throw exceptions.
ja: ストリームを閉じるハンドラは先行するハンドラが例外を投げたとしても全て実行される。

source: All streams operations can execute either in serial or in parallel.
ja: 全てのストリーム処理は逐次的にも並列にも実行できる。

source: All the streams returned from JDK collections, and most other JDK classes, are well-behaved in this manner; for streams generated by other libraries, see Low-level stream construction for requirements for building well-behaved streams.
ja: JDKの全てのコレクションや他のほとんどのJDKクラスから返されるストリームはこの意味で行儀が良い。他のライブラリから生成されるストリームに関して、行儀が良いストリームを構築するための必要条件については低水準ストリーム構築を参照せよ。

source: An equivalent sequence of increasing values can be produced sequentially using a {@code for} loop as follows:
ja: 増加する値の同等な列は{@code for}ループを使って次のように逐次的に生成できる。

source: An example of a stateful lambda is the parameter to {@code map()} in:
ja: 状態を持つラムダの例は次のコードの中での{@code map()}へのパラメータである。

source: An intermediate operation is short-circuiting if, when presented with infinite input, it may produce a finite stream as a result.
ja: 中間処理は、無限の入力を与えられた際に有限のストリームを結果として生成する場合があるならば短絡的である。

source: An operation on a stream produces a result, but does not modify its source.
ja: ストリームに対する処理は成果物を生成するが、元となるデータ源を変更しない。

source: An operator or function {@code op} is associative if the following holds:
ja: 演算子または関数{@code op}は次の条件を満たすとき結合的である。

source: An {@code IllegalStateException} is thrown if there are further attempts to operate on the builder after it has entered the built state.
ja: このビルダに対してさらなる処理をしようとすると{@code IllegalStateException}が投げられる。

source: And the following produces a {@code Map} mapping a unique identifier to students:
ja: そして次のコードは一意的な識別子から生徒に写像する{@code Map}を生成する。

source: As a result, under parallel computation, some pipelines containing stateful intermediate operations may require multiple passes on the data or may need to buffer significant data.
ja: 結果として、並列計算において、状態を持つ中間処理を含むパイプラインは複数のパスで実行される必要がある場合がある。

source: As an example of how to transform a stream pipeline that inappropriately uses side-effects to one that does not, the following code searches a stream of strings for those matching a given regular expression, and puts the matches in a list.
ja: 不適切に副作用を使うストリームパイプラインを使わないものに変換する方法の例として、次のコードは文字列のストリームから与えられた正規表現に適合する文字列を探して適合結果をリストに保存する。

source: As with the regular reduction operation, {@code collect()} operations can only be parallelized if appropriate conditions are met.
ja: 通常の簡約処理と同じように{@code collect()}処理も適切な条件を満たしたときのみ並列化できる。

source: As with {@code reduce()}, a benefit of expressing {@code collect} in this abstract way is that it is directly amenable to parallelization: we can accumulate partial results in parallel and then combine them, so long as the accumulation and combining functions satisfy the appropriate requirements.
ja: {@code reduce()}と同様に{@code collect}をこのような抽象的な形で表す利点は、並列化を直ちに適用できる点である。つまり累積関数と統合関数が要件を満たす限り、中間結果を並列に累積し、その後統合するようにできる。

source: Associativity
ja: 結合性

source: At the lowest level, all streams are driven by a spliterator.
ja: 最も下の水準では、全てのストリームはスプリッテレータを使って駆動する。

source: Base interface for streams, which are sequences of elements supporting sequential and parallel aggregate operations.
ja: ストリームの基礎となるインターフェース。逐次集計処理および並列集計処理を備える要素の列である。

source: Builds the stream, transitioning this builder to the built state.
ja: ストリームを構築し、このビルダを構築済状態に移行させる。

source: By contrast, streams do not provide a means to directly access or manipulate their elements, and are instead concerned with declaratively describing their source and the computational operations which will be performed in aggregate on that source.
ja: 対照的に、ストリームは要素へ直接アクセスする手段や要素を直接操作する手段を備えておらず、代わりに情報源と、情報源に対してまとめて実行される計算処理を宣言的に示すことに注意を注ぐ。

source: Calling this method after invoking an terminal stream operation method may yield unpredictable results.
ja: 末端ストリーム処理を起動した後にこのメソッドを呼ぶと予測できない結果を得る場合がある。

source: Certain aggregate operations, such as filtering duplicates ( {@code distinct()}) or grouped reductions ( {@code Collectors.groupingBy()}) can be implemented more efficiently if ordering of elements is not relevant.
ja: 重複の除去({@code distinct()})やグループ化({@code Collectors.groupingBy()})などのある種の集約処理は要素の順序が重要でなければより効率的に実装できる。

source: Certain stream sources (such as {@code List} or arrays) are intrinsically ordered, whereas others (such as {@code HashSet}) are not.
ja: ある種のストリーム源({@code List}や配列など)は本質的に順序付けられている(ordered)が、他のもの({@code HashSet}など)はそうでない。

source: Characteristics indicating properties of a {@code Collector}, which can be used to optimize reduction implementations.
ja: 簡約処理の実装の最適化に利用できる、{@code Collector}の性質を表す特性。

source: Classes to support functional-style operations on streams of elements, such as map-reduce transformations on collections.
ja: コレクションに対する写像(map)・簡約(reduce)変換といった、関数型の操作を要素のストリームに対して提供するクラス群。

source: Close handlers are run when the {@link #close()} method is called on the stream, and are executed in the order they were added.
ja: ストリームを閉じるハンドラはストリームの{@link #close()}メソッドが呼ばれた差異に呼ばれ、追加された順序で実行される。

source: Closes this stream, causing all close handlers for this stream pipeline to be called.
ja: このストリームを閉じ、ストリームパイプラインを閉じる全てのハンドラが呼ばれるようにする。

source: Collections and streams, while bearing some superficial similarities, have different goals.
ja: コレクションとストリームは表面上の類似点はあるものの、異なる目的を持つ。

source: Collections are primarily concerned with the efficient management of, and access to, their elements.
ja: コレクションはその要素の効率的な管理とその要素への効率的なアクセスに主に注意を注ぐ。

source: Collectors also have a set of characteristics, such as {@link Characteristics#CONCURRENT}, that provide hints that can be used by a reduction implementation to provide better performance.
ja: Collectorは{@link Characteristics#CONCURRENT}といった特性の集合を備える。これらの特性は簡約の実装がより良い性能を出すためのヒントとして扱われる。

source: Collectors are designed to be composed; many of the methods in {@link Collectors} are functions that take a collector and produce a new collector.
ja: コレクタは合成できるように設計してある。{@link Collectors}にある多くのメソッドはコレクタを受け取り新しいコレクタを作る関数である。

source: Concurrent stream sources are those whose {@code Spliterator} reports the {@code CONCURRENT} characteristic.
ja: 並行ストリーム源とはその{@code Spliterator}が{@code CONCURRENT}特性を示すものである。

source: Consequently, a concurrent reduction is only possible if ordering is not important for the stream being processed.
ja: その結果、並行簡約は処理しているストリームに対して順序が重要でない場合のみ可能となる。

source: Consumable.
ja: 消費できる。

source: Creates a lazily concatenated stream whose elements are all the elements of the first stream followed by all the elements of the second stream.
ja: ストリームの要素が、最初のストリームの全ての要素の後に2つ目のストリームの全ての要素を並べたような、遅延的に連結されたストリームを返す。
